{"class_name": "Sequential", "keras_version": "2.2.4", "config": {"name": "sequential_1", "layers": [{"class_name": "Conv2D", "config": {"dtype": "float32", "strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_1", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_constraint": null, "batch_input_shape": [null, 32, 32, 3]}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_1", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_2", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "filters": 32, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_2", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_1", "rate": 0.25, "noise_shape": null}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_3", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_3", "activation": "relu"}}, {"class_name": "Conv2D", "config": {"strides": [1, 1], "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_size": [3, 3], "bias_regularizer": null, "data_format": "channels_last", "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "conv2d_4", "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "dilation_rate": [1, 1], "padding": "same", "filters": 64, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_4", "activation": "relu"}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "pool_size": [2, 2], "strides": [2, 2], "data_format": "channels_last", "padding": "valid"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_2", "rate": 0.25, "noise_shape": null}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 513, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "dense_1", "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_5", "activation": "relu"}}, {"class_name": "Dropout", "config": {"seed": null, "trainable": true, "name": "dropout_3", "rate": 0.5, "noise_shape": null}}, {"class_name": "Dense", "config": {"units": 10, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "bias_constraint": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "name": "dense_2", "activation": "linear", "activity_regularizer": null, "bias_regularizer": null, "trainable": true, "kernel_constraint": null}}, {"class_name": "Activation", "config": {"trainable": true, "name": "activation_6", "activation": "softmax"}}]}, "backend": "tensorflow"}